In [3]:
import pandas as pd
import numpy as np

In [7]:
s=pd.Series(dtype='float')

In [10]:
type(s)

pandas.core.series.Series

In [13]:
s=pd.Series([1,2,3,4],dtype='float')
s

0    1.0
1    2.0
2    3.0
3    4.0
dtype: float64

In [18]:
s=pd.Series(np.arange(4))
s

0    0
1    1
2    2
3    3
dtype: int32

In [23]:
s.values
list(s.index)

[0, 1, 2, 3]

In [28]:
s=pd.Series([1,2,3,4],dtype='float',index=['a','b','c','d'])
s

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

In [32]:
s=pd.Series([1,2,3,4],dtype='float',index=['a','b','c','d'],name='numbers')
s

a    1.0
b    2.0
c    3.0
d    4.0
Name: numbers, dtype: float64

In [34]:
d={
    'k1':'v1',
    'k2':'v2',
    'k3':'v3',
    'k4':'v4',
    'k5':'v5',
    'k6':'v6'
}

In [38]:
s=pd.Series(d,dtype='str')
s

k1    v1
k2    v2
k3    v3
k4    v4
k5    v5
k6    v6
dtype: object

In [42]:
a=[1,2,3,4,5,6,1]
a

[1, 2, 3, 4, 5, 6, 1]

In [45]:
df=pd.DataFrame(a)#every row and colume is series
df

   0
0  1
1  2
2  3
3  4
4  5
5  6
6  1

In [49]:
df.columns=['head']
df

   head
0     1
1     2
2     3
3     4
4     5
5     6
6     1

In [58]:
data = [
 
    ['ram', 10],
    ['ram', 10],
    ['ram', 10],
    ['ram', 10],
]

# Creating the DataFrame
df = pd.DataFrame(data, columns=['NAme', 'age'])

print(df)

  NAme  age
0  ram   10
1  ram   10
2  ram   10
3  ram   10

In [60]:
data = [
 
    ['name','age'],
    ['ram', 10],
    ['ram', 10],
    ['ram', 10],
]

# Creating the DataFrame
df = pd.DataFrame(data[1:], columns=data[0])

print(df)

  name  age
0  ram   10
1  ram   10
2  ram   10

In [5]:
df=pd.read_csv('titanic.csv')

In [13]:
df[1:4]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.55,C22,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.55,C22,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.55,C22,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"

In [18]:
df.loc[3]

pclass                                          1
survived                                        0
name         Allison, Mr. Hudson Joshua Creighton
sex                                          male
age                                          30.0
sibsp                                           1
parch                                           2
ticket                                     113781
fare                                       151.55
cabin                                         C22
embarked                                        S
boat                                          NaN
body                                        135.0
home.dest         Montreal, PQ / Chesterville, ON
Name: 3, dtype: object

In [27]:
df.set_index('name').loc[['Allison, Mr. Hudson Joshua Creighton'],['age']]

                                       age
name
Allison, Mr. Hudson Joshua Creighton  30.0

In [30]:
df.set_index('name').loc['Allison, Mr. Hudson Joshua Creighton','age']

30.0

In [32]:
df.set_index('name').at['Allison, Mr. Hudson Joshua Creighton','age']#faster for single value than loc

30.0

In [33]:
df.loc[df'age']>20 & {df.'age'}]

SyntaxError: unmatched ']' (1497789710.py, line 1)

In [40]:
df.cabin.value_counts()

cabin
F       8
C23     6
G6      5
B57     5
C78     4
       ..
B102    1
B39     1
D40     1
D34     1
F38     1
Name: count, Length: 181, dtype: int64

In [43]:
S=selected_cabin=['E44','A26']

['E44', 'A26']